app/controllers/home_controller.rb

SELECT * FROM `users` WHERE (`users`.`id` = 1)
---
  def index
    # if logged in render loggedin page
    if not session[:user_id].nil?
      @user = User.find(session[:user_id])

SELECT * FROM `users` WHERE (`users`.`id` = 1)
---
  def loggedin
    # if not logged in redirect/render home/index page
    if not session[:user_id].nil?
      @user = User.find(session[:user_id])