app/controllers/login_controller.rb

SELECT * FROM `users` WHERE (`users`.`sc_user_id` = 3207) LIMIT 1
INSERT INTO "users" ("created_at", "sc_user_id", "updated_at", "upload_secret", "access_token_secret", "sc_username", "access_token") VALUES('2009-05-04 23:50:39', 3207, '2009-05-04 23:50:39', NULL, '4qcvgMVu6xv6jBScTOjckKGwFCaAIWWHQLEMP8SpjbM', 'jwagener', 'iaZpNUD7Nw0uf0stGlWU0A')
UPDATE "users" SET "updated_at" = '2009-05-04 23:51:48', "access_token_secret" = 'h7IlPbfCqp5RkCidCcq1bvZbrnPpEIVODfkEBnjKUE', "access_token" = '8MiiOhh37OIHsS9wEFfbEA' WHERE "id" = 1
---
  def callback
    request_token = OAuth::RequestToken.new($sc_consumer, session[:request_token], session[:request_token_secret])
    access_token = request_token.get_access_token

    sc = Soundcloud.register({:access_token => access_token})

    me = sc.User.find_me

    # check if user with me.id exists, update username & oauth stuff otherwise create a new user
    user = User.find_by_sc_user_id(me.id)
    if user.nil?
      user = User.create({:sc_user_id => me.id, :sc_username => me.username,
               :access_token => access_token.token, :access_token_secret => access_token.secret })
    else
      user.sc_username = me.username
      user.access_token = access_token.token
      user.access_token_secret = access_token.secret
      user.save!